<?php

namespace Database\Seeders;

use App\Models\WorkCategory;
use Illuminate\Database\Seeder;

class WorkCategorySeeder extends Seeder
{
    /**
     * Run the database seeds.
     *
     * @return void
     */
    public function run()
    {
        if (WorkCategory::query()->whereBetween('id', [1, 1000])->first()) {
            return;
        }

        WorkCategory::query()->insert([
            # Методы
            ["title" => "Гештальт-терапия", "type" => "method"],
            ["title" => "Интегративный подход", "type" => "method"],
            ["title" => "Когнитивно-поведенческий подход", "type" => "method"],
            ["title" => "Коучинг", "type" => "method"],
            ["title" => "Лакановский психоанализ", "type" => "method"],
            ["title" => "Личностно-ориентированный реконструктивный подход", "type" => "method"],
            ["title" => "Психоанализ и психоаналитическая терапия", "type" => "method"],
            ["title" => "Системный семейный подход", "type" => "method"],
            ["title" => "Транзактный анализ", "type" => "method"],
            ["title" => "Экзистенциально-гуманистический подход", "type" => "method"],
            ["title" => "Юнгианский анализ", "type" => "method"],
            # Проблемы
            ["title" => "Нарушение сна, бессонница, кошмары, мигрени", "type" => "error"],
            ["title" => "Подозрение на психическое расстройство ", "type" => "error"],
            ["title" => "Проблемы с детьми, помощь подростка", "type" => "error"],
            ["title" => "Психологическое бесплодие, подготовка к беременности и родам", "type" => "error"],
            ["title" => "Психосоматика, вопросы здоровья, сопровождение при тяжелом заболевании, онкологии", "type" => "error"],
            ["title" => "Проблемы в секскусальной сфере", "type" => "error"],
            ["title" => "Сложности в бизнесе, профессиональной деятельности", "type" => "error"],
            ["title" => "Профессиональная ориентация, сложность при выборе работы", "type" => "error"],
            ["title" => "Поиск жизненного пути, низкая самооценка ", "type" => "error"],
            ["title" => "Утрата смысла жизни, утрата собственного Я, одиночество ", "type" => "error"],
            ["title" => "Проблемы в настроение: депрессия, тревога, эмоциональная нестабильность", "type" => "error"],
            ["title" => "Страхи и фобии, панические атаки, навязчивые состояние или мысли", "type" => "error"],
            ["title" => "Травматическое событие: насилие, авария, потеря близкого человека и др", "type" => "error"],
            ["title" => "Эмоциональная зависимость, несчастная любовь", "type" => "error"],
            ["title" => "Кризисные ситуации в семье: развод, измена, конфликты", "type" => "error"],
            ["title" => "Проблема в межличностных отношениях: с близкими, родными, коллегами, друзьями", "type" => "error"],
            ["title" => "Нарушение пищевого поведения (переедание, булимия, анорексия)", "type" => "error"],
            ["title" => "Созависимость и зависимости: алкогольная, наркотическая, игровая ", "type" => "error"],
            ["title" => "Адаптация к новым условия (новая страна, школа, садик и тд.)", "type" => "error"],
            ["title" => "Гендерная идентичность, ЛГБТ", "type" => "error"],
            ["title" => "Проблемы пожилого возраста, работа с родственниками пожилых людей", "type" => "error"],
        ]);

    }
}

